Revit 2027 API
PartMakerMethodToDivideVolumes.ProfileType Property
 The id of the profile family applied to boundaries between parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ProfileType { get; set; }
Public Property ProfileType As ElementId
	Get
	Set
public:
property ElementId^ ProfileType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ProfileType : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace